ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
      __IOM uint32_t INVALIDATE : 1;            /*!< [0..0] Writing a 1 to this bitfield invalidates the CM4 cache
                                                     contents.                                                                 */
      __IOM uint32_t RESETSTAT  : 1;            /*!< [1..1] Reset Cache Statistics. When written to a 1, the cache
                                                     monitor counters will be cleared. The monitor counters
                                                     can be reset only when the CACHECFG.ENABLE_MONITOR bit
                                                     is set.                                                                   */
      __IOM uint32_t CACHEREADY : 1;            /*!< [2..2] Cache Ready Status (enabled and not processing an invalidate
                                                     operation)                                                                */
            uint32_t            : 29;
    } CACHECTRL_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t NCR0START;                   /*!< (@ 0x00000010) CM4 Cache Noncachable Region 0 Start                       */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< [28..4] Start address for non-cacheable region 0                          */
            uint32_t            : 3;
    } NCR0START_b;
  } ;

  union {
    __IOM uint32_t NCR0END;                     /*!< (@ 0x00000014) CM4 Cache Noncachable Region 0 End                         */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< [28..4] End address for non-cacheable region 0                            */
            uint32_t            : 3;
    } NCR0END_b;
  } ;

  union {
    __IOM uint32_t NCR1START;                   /*!< (@ 0x00000018) CM4 Cache Noncachable Region 1 Start                       */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< [28..4] Start address for non-cacheable region 1                          */
            uint32_t            : 3;
    } NCR1START_b;
  } ;

  union {
    __IOM uint32_t NCR1END;                     /*!< (@ 0x0000001C) CM4 Cache Noncachable Region 1 End                         */

    struct {
            uint32_t            : 4;
      __IOM uint32_t ADDR       : 25;           /*!< [28..4] End address for non-cacheable region 1                            */
            uint32_t            : 3;
    } NCR1END_b;
  } ;
  __IM  uint32_t  RESERVED2[12];

  union {
    __IOM uint32_t DAXICFG;                     /*!< (@ 0x00000050) DAXI Config                                                */

    struct {
      __IOM uint32_t FLUSHLEVEL : 1;            /*!< [0..0] Level of free buffers to flush out dirty buffers.                  */
      __IOM uint32_t AGINGSENABLE : 1;          /*!< [1..1] Enables flushing out shared lines using the aging mechanism.       */
      __IOM uint32_t DAXIPASSTHROUGH : 1;       /*!< [2..2] Passes requests through DAXI logic, disables caching
                                                     lines in the DAXI line buffers.                                           */
      __IOM uint32_t DAXIBECLKGATEEN : 1;       /*!< [3..3] Enables clock gating of DAXI line buffer byte enables.             */
      __IOM uint32_t DAXIDATACLKGATEEN : 1;     /*!< [4..4] Enables clock gating of DAXI line buffer data.                     */
      __IOM uint32_t DAXISTATECLKGATEEN : 1;    /*!< [5..5] Enables clock gating of DAXI state.                                */
            uint32_t            : 2;
      __IOM uint32_t BUFFERENABLE : 4;          /*!< [11..8] Enables DAXI buffers                                              */
            uint32_t            : 4;
      __IOM uint32_t AGINGCOUNTER : 5;          /*!< [20..16] Specifies the relative time that DAXI buffers may remain
                                                     unused before being flushed. Counter is based on CPU clock
                                                     cycles and buffers will generally be flushed in 1-2 AGINGCOUNTER
                                                     timesteps.                                                                */
            uint32_t            : 3;
      __IOM uint32_t MRUGROUPLEVEL : 2;         /*!< [25..24] Sets the MRU group population limit.                             */
            uint32_t            : 6;
    } DAXICFG_b;
  } ;

  union {
    __IOM uint32_t DAXICTRL;                    /*!< (@ 0x00000054) DAXI Control                                               */

    struct {
      __IOM uint32_t DAXIFLUSHWRITE : 1;        /*!< [0..0] Writing a 1 to this bitfield forces a flush of WRITE
                                                     (W->I) or MODIFIED buffers (M->S).                                        */
      __IOM uint32_t DAXIINVALIDATE : 1;        /*!< [1..1] Writing a 1 to this bitfield invalidates any SHARED data
                                                     buffers (S->I).                                                           */
      __IOM uint32_t DAXIREADY  : 1;            /*!< [2..2] DAXI Ready Status (enabled and not processing a flush
                                                     of WRITE or MODIFIED buffers)                                             */
      __IOM uint32_t DAXIBUSY   : 1;            /*!< [3..3] DAXI status indicating DAXI is busy.                               */
      __IOM uint32_t DAXIAHBBUSY : 1;           /*!< [4..4] DAXI status indicating DAXI AHB interface is busy.                 */
      __IOM uint32_t DAXISHARED : 1;            /*!< [5..5] DAXI status indicating at least one full buffer is shared.         */
      __IOM uint32_t DAXIMODIFIED : 1;          /*!< [6..6] DAXI status indicating at least one full buffer has modified
                                                     data.                                                                     */
      __IOM uint32_t DAXIWRITE  : 1;            /*!< [7..7] DAXI status indicating at least one partially written
                                                     buffer has modified data.                                                 */
      __IOM uint32_t DAXIWALLOC : 1;            /*!< [8..8] DAXI status indicating at least one write allocation
                                                     is waiting for prior store to complete.                                   */
      __IOM uint32_t DAXIWRLOAD : 1;            /*!< [9..9] DAXI status indicating at least one partially written
                                                     buffer is waiting for load to convert to modified.                        */
      __IOM uint32_t DAXISTORE  : 1;            /*!< [10..10] DAXI status indicating at least one buffer has outstanding
                                                     store waiting to complete.                                                */
      __IOM uint32_t DAXIBRESPPENDING : 1;      /*!< [11..11] DAXI status indicating at least one AXI B repsonse
                                                     for a store is pending.                                                   */
      __IOM uint32_t DAXIRAXIBUSY : 1;          /*!< [12..12] DAXI status indicating the DAXI RAXI interface is busy.          */
            uint32_t            : 19;
    } DAXICTRL_b;
  } ;
  __IM  uint32_t  RESERVED3[10];

  union {
    __IOM uint32_t ICODEFAULTADDR;              /*!< (@ 0x00000080) ICODE bus address which was present when a bus
                                                                    fault occurred.                                            */

