ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
      __IOM uint32_t RESX       : 16;           /*!< [15..0] resolution X size                                                 */
      __IOM uint32_t RESY       : 16;           /*!< [31..16] resolution Y size                                                */
    } TEX0RES_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t TEX1BASE;                    /*!< (@ 0x00000010) Base address of the drawing surface 1 (must be
                                                                    word aligned).                                             */

    struct {
      __IOM uint32_t Base       : 32;           /*!< [31..0] address 1: base address of the drawing surface 1 (must
                                                     be word aligned).                                                         */
    } TEX1BASE_b;
  } ;

  union {
    __IOM uint32_t TEX1STRIDE;                  /*!< (@ 0x00000014) Image 1 mode and stride.                                   */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< [15..0] image stride (signed) distance in bytes from one scanline
                                                     to another                                                                */
      __IOM uint32_t IMGMODE    : 8;            /*!< [23..16] Image Mode                                                       */
      __IOM uint32_t IMGFMT     : 8;            /*!< [31..24] Image Format                                                     */
    } TEX1STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX1RES;                     /*!< (@ 0x00000018) Image 1 resolution.                                        */

    struct {
      __IOM uint32_t RESX       : 16;           /*!< [15..0] resolution X size                                                 */
      __IOM uint32_t RESY       : 16;           /*!< [31..16] resolution Y size                                                */
    } TEX1RES_b;
  } ;

  union {
    __IOM uint32_t TEX1COLOR;                   /*!< (@ 0x0000001C) Texture maps default color.Used with luminance
                                                                    and alpha-only color formats.                              */

    struct {
      __IOM uint32_t RED        : 8;            /*!< [7..0] red value                                                          */
      __IOM uint32_t GREEN      : 8;            /*!< [15..8] green value                                                       */
      __IOM uint32_t BLUE       : 8;            /*!< [23..16] blue value                                                       */
      __IOM uint32_t ALPHA      : 8;            /*!< [31..24] alpha value                                                      */
    } TEX1COLOR_b;
  } ;

  union {
    __IOM uint32_t TEX2BASE;                    /*!< (@ 0x00000020) Base address of the drawing surface 2 (must be
                                                                    word aligned).                                             */

    struct {
      __IOM uint32_t Drawing    : 32;           /*!< [31..0] surface 2 Base address of the drawing surface 2                   */
    } TEX2BASE_b;
  } ;

  union {
    __IOM uint32_t TEX2STRIDE;                  /*!< (@ 0x00000024) Image 2 mode and stride.                                   */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< [15..0] image stride (signed) distance in bytes from one scanline
                                                     to another                                                                */
      __IOM uint32_t IMGMODE    : 8;            /*!< [23..16] image mode                                                       */
      __IOM uint32_t IMGFMT     : 8;            /*!< [31..24] image format                                                     */
    } TEX2STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX2RES;                     /*!< (@ 0x00000028) Image 2 resolution.                                        */

    struct {
      __IOM uint32_t RESX       : 16;           /*!< [15..0] resolution X size                                                 */
      __IOM uint32_t RESY       : 16;           /*!< [31..16] resolution Y size                                                */
    } TEX2RES_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t TEX3BASE;                    /*!< (@ 0x00000030) Base address of the drawing surface 3 (must be
                                                                    word aligned).                                             */

    struct {
      __IOM uint32_t Image      : 32;           /*!< [31..0] 3 Base address of the drawing surface                             */
    } TEX3BASE_b;
  } ;

  union {
    __IOM uint32_t TEX3STRIDE;                  /*!< (@ 0x00000034) mode and stride.                                           */

    struct {
      __IOM uint32_t IMGSTRD    : 16;           /*!< [15..0] image stride (signed) distance in bytes from one scanline
                                                     to another                                                                */
      __IOM uint32_t IMGMODE    : 8;            /*!< [23..16] image mode                                                       */
      __IOM uint32_t IMGFMT     : 8;            /*!< [31..24] image format                                                     */
    } TEX3STRIDE_b;
  } ;

  union {
    __IOM uint32_t TEX3RES;                     /*!< (@ 0x00000038) Image 3 resolution.                                        */

    struct {
      __IOM uint32_t RESX       : 16;           /*!< [15..0] resolution X size                                                 */
      __IOM uint32_t RESY       : 16;           /*!< [31..16] resolution Y size                                                */
    } TEX3RES_b;
  } ;
  __IM  uint32_t  RESERVED2[21];

  union {
    __IOM uint32_t CGCMD;                       /*!< (@ 0x00000090) Clock gating enable                                        */

