ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
      __IOM uint32_t BASEPTR    : 32;           /*!< [31..0] Command list base pointer.                                        */
    } CMDLISTADDR_b;
  } ;

  union {
    __IOM uint32_t CMDLISTSIZE;                 /*!< (@ 0x000000F4) Command list length in words.                              */

    struct {
      __IOM uint32_t LISTWORDS  : 32;           /*!< [31..0] Command list length in words.                                     */
    } CMDLISTSIZE_b;
  } ;

  union {
    __IOM uint32_t INTERRUPTCTRL;               /*!< (@ 0x000000F8) On write, clears the IRQ (CHECK address!).                 */

    struct {
      __IOM uint32_t IRQACTIVE  : 1;            /*!< [0..0] if set to zero IRQ is active high, if set to one IRQ
                                                     is active low                                                             */
      __IOM uint32_t INTCMDEND  : 1;            /*!< [1..1] if set, signals interrupt at the end of command list               */
      __IOM uint32_t INTDRAWEND : 1;            /*!< [2..2] if set, signals interrupt at the end of drawing command            */
      __IOM uint32_t AUTOCLR    : 1;            /*!< [3..3] if set, auto clears interrupt                                      */
      __IOM uint32_t RSVD       : 26;           /*!< [29..4] This bitfield is reserved.                                        */
      __IOM uint32_t CHANGEFREQ : 2;            /*!< [31..30] change frequency of asynchronous clock                           */
    } INTERRUPTCTRL_b;
  } ;

  union {
    __IOM uint32_t SYSCLEAR;                    /*!< (@ 0x000000FC) On write, resets the GPU (CHECK address!).                 */

    struct {
      __IOM uint32_t RESETGPU   : 32;           /*!< [31..0] On write, resets the GPU (CHECK address!).                        */
    } SYSCLEAR_b;
  } ;

  union {
    __IOM uint32_t DRAWCMD;                     /*!< (@ 0x00000100) Rasterizer drawing command.                                */

    struct {
      __IOM uint32_t START      : 3;            /*!< [2..0] Start the draw command                                             */
      __IOM uint32_t RSVD       : 29;           /*!< [31..3] This bitfield is reserved.                                        */
    } DRAWCMD_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0;                     /*!< (@ 0x00000104) Stores only integer values. For greater accurancy
                                                                    DRAWPT0X and DRAWPT0Y registers are used
                                                                    which are 16, 16 fixed point.                              */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< [15..0] vertex 0 X coordinate (integer value)                             */
      __IOM uint32_t COORDY     : 16;           /*!< [31..16] vertex 0 Y coordinate (integer value)                            */
    } DRAWPT0_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1;                     /*!< (@ 0x00000108) Stores only integer values. Vertex 1 drawing
                                                                    primitive. Stores only integer values. For
                                                                    greater accurancy DRAWPT1X and DRAWPT1Y
                                                                    registers are used which are 16, 16 fixed
                                                                    point.                                                     */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< [15..0] vertex 0 X coordinate (integer value)                             */
      __IOM uint32_t COORDY     : 16;           /*!< [31..16] vertex 0 Y coordinate (integer value)                            */
    } DRAWPT1_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t CLIPMIN;                     /*!< (@ 0x00000110) Clipping rectangle upper left vertex.                      */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< [15..0] upper left X coordinate                                           */
      __IOM uint32_t COORDY     : 16;           /*!< [31..16] upper left Y coordinate                                          */
    } CLIPMIN_b;
  } ;

  union {
    __IOM uint32_t CLIPMAX;                     /*!< (@ 0x00000114) Clipping rectangle bottom right vertex.                    */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< [15..0] bottom right X coordinate                                         */
      __IOM uint32_t COORDY     : 16;           /*!< [31..16] bottom right Y coordinate                                        */
    } CLIPMAX_b;
  } ;

  union {
    __IOM uint32_t RASTCTRL;                    /*!< (@ 0x00000118) Rasterizer matrix multiplication control                   */

    struct {
      __IOM uint32_t RSVD       : 28;           /*!< [27..0] This bitfield is reserved.                                        */
      __IOM uint32_t BYPASS     : 1;            /*!< [28..28] tells module to bypass calculations                              */
      __IOM uint32_t ADD        : 1;            /*!< [29..29] adds 0.5 to X and Y                                              */
      __IOM uint32_t PERSP      : 2;            /*!< [31..30] when set to 0 is in perspective mode (MISTAKE IN DOC?)           */
    } RASTCTRL_b;
  } ;

  union {
    __IOM uint32_t DRAWCODEPTR;                 /*!< (@ 0x0000011C) DRAWCODEPTR register description needed here.              */

    struct {
      __IOM uint32_t FRGND      : 16;           /*!< [15..0] the pointer for the instruction that will be executed
                                                     for foreground pixel                                                      */
      __IOM uint32_t BKGND      : 16;           /*!< [31..16] the pointer for the instruction that will be executed
                                                     for background pixel                                                      */
    } DRAWCODEPTR_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0X;                    /*!< (@ 0x00000120) X coordinate of Vertex 0 drawing primitive 16,
                                                                    16 fixed point.                                            */

