ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
      __IOM uint32_t BLUEX      : 32;           /*!< [31..0] Added blue value for each step at x-axis                          */
    } BLUEX_b;
  } ;

  union {
    __IOM uint32_t BLUEY;                       /*!< (@ 0x000001B4) Added blue value for each step at y-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t BLUEY      : 32;           /*!< [31..0] Added blue value for each step at y-axis                          */
    } BLUEY_b;
  } ;

  union {
    __IOM uint32_t ALFX;                        /*!< (@ 0x000001B8) Added alfa value for each step at x-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t ALFX       : 32;           /*!< [31..0] Added alfa value for each step at x-axis                          */
    } ALFX_b;
  } ;

  union {
    __IOM uint32_t ALFY;                        /*!< (@ 0x000001BC) Added alfa value for each step at y-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t ALFY       : 32;           /*!< [31..0] Added alfa value for each step at y-axis                          */
    } ALFY_b;
  } ;

  union {
    __IOM uint32_t REDINIT;                     /*!< (@ 0x000001C0) Red value of STARTXY pixel, (16, 16 fixed point)           */

    struct {
      __IOM uint32_t REDXY      : 32;           /*!< [31..0] Red value of STARTXY pixel                                        */
    } REDINIT_b;
  } ;

  union {
    __IOM uint32_t GREINIT;                     /*!< (@ 0x000001C4) Green value of STARTXY pixel, (16, 16 fixed point)         */

    struct {
      __IOM uint32_t GREENXY    : 32;           /*!< [31..0] Green value of STARTXY pixel                                      */
    } GREINIT_b;
  } ;

  union {
    __IOM uint32_t BLUINIT;                     /*!< (@ 0x000001C8) Blue value of STARTXY pixel, (16, 16 fixed point)          */

    struct {
      __IOM uint32_t BLUEXY     : 32;           /*!< [31..0] Blue value of STARTXY pixel                                       */
    } BLUINIT_b;
  } ;

  union {
    __IOM uint32_t ALFINIT;                     /*!< (@ 0x000001CC) Alfa value of STARTXY pixel, (16, 16 fixed point)
                                                                    Shader Registers                                           */

    struct {
      __IOM uint32_t ALFXY      : 32;           /*!< [31..0] Alfa value of STARTXY pixel                                       */
    } ALFINIT_b;
  } ;
  __IM  uint32_t  RESERVED11[7];

  union {
    __IOM uint32_t IDREG;                       /*!< (@ 0x000001EC) Fixed value                                                */

    struct {
      __IOM uint32_t GPUID      : 32;           /*!< [31..0] Fixed value for GPU ID                                            */
    } IDREG_b;
  } ;

  union {
    __IOM uint32_t LOADCTRL;                    /*!< (@ 0x000001F0) Load Control                                               */

    struct {
      __IOM uint32_t LOADCTRL   : 32;           /*!< [31..0] Load Control                                                      */
    } LOADCTRL_b;
  } ;
  __IM  uint32_t  RESERVED12[3];

  union {
    __IOM uint32_t C0REG;                       /*!< (@ 0x00000200) Shader constant register 0.                                */

    struct {
      __IOM uint32_t C0SHADER   : 32;           /*!< [31..0] Shader constant register 0.                                       */
    } C0REG_b;
  } ;

  union {
    __IOM uint32_t C1REG;                       /*!< (@ 0x00000204) Shader constant register 1.                                */

    struct {
      __IOM uint32_t C1SHADER   : 32;           /*!< [31..0] Shader constant register 1.                                       */
    } C1REG_b;
  } ;

  union {
    __IOM uint32_t C2REG;                       /*!< (@ 0x00000208) Shader constant register 2.                                */

    struct {
      __IOM uint32_t C2SHADER   : 32;           /*!< [31..0] Shader constant register 2                                        */
    } C2REG_b;
  } ;

  union {
    __IOM uint32_t C3REG;                       /*!< (@ 0x0000020C) Shader constant register 3, the dirty Region
                                                                    Register                                                   */

    struct {
      __IOM uint32_t C3SHADER   : 32;           /*!< [31..0] Shader constant register 3                                        */
    } C3REG_b;
  } ;
  __IM  uint32_t  RESERVED13[888];

  union {
    __IOM uint32_t IRQID;                       /*!< (@ 0x00000FF0) Signals interrupt when set (CHECK address!).               */

    struct {
      __IOM uint32_t IRQID      : 32;           /*!< [31..0] Signals interrupt when set (CHECK address!                        */
    } IRQID_b;
  } ;
} GPU_Type;                                     /*!< Size = 4084 (0xff4)                                                       */



/* =========================================================================================================================== */
/* ================                                           I2S0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief I2S Master/Slave Module (I2S0)
  */

typedef struct {                                /*!< (@ 0x40208000) I2S0 Structure                                             */

  union {
    __IOM uint32_t RXDATA;                      /*!< (@ 0x00000000) Read only access to the i2S receive data                   */

    struct {
      __IOM uint32_t RXSAMPLE   : 32;           /*!< [31..0] 32b audio sample from the internal receive FIFO. MSB
                                                     is always in bit 31                                                       */
    } RXDATA_b;
  } ;

  union {
    __IOM uint32_t RXCHANID;                    /*!< (@ 0x00000004) Read only received channel identification register         */

