ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
      __IOM uint32_t OEN        : 1;            /*!< [0..0] Output enable for SDATA output                                     */
            uint32_t            : 3;
      __IOM uint32_t FPER       : 12;           /*!< [15..4] Frame period in units of sclk. Period is FPER + 1 sclks
                                                     in length. 0: 1 sclk, 0x3F: 64 sclks                                      */
      __IOM uint32_t FSP        : 1;            /*!< [16..16] Polarity of fsync/lr_clk signal. 0: Active high. 1:
                                                     Active low                                                                */
      __IOM uint32_t PRTX       : 1;            /*!< [17..17] Transmit clock edge polarity bit. 0: sdata is transmitted
                                                     starting from the falling edge of sclk. 1: sdata is transmitted
                                                     starting from the rising edge of sclk.                                    */
      __IOM uint32_t MSL        : 1;            /*!< [18..18] Master/Slave clock configuration. 0: External clock(sclk
                                                     and lr_clk provided externally). 1: Internal clock (sclk
                                                     and lr_clk sourced internally).                                           */
      __IOM uint32_t PRx        : 1;            /*!< [19..19] Receive clock edge polarity bit. 0: sdata is sampled
                                                     on the rising edge of sclk. 1: sdata is sampled on the
                                                     falling edge of sclk.                                                     */
      __IOM uint32_t FWID       : 8;            /*!< [27..20] period of fsync/lr_clk in units of sclks                         */
            uint32_t            : 4;
    } I2SIOCFG_b;
  } ;

  union {
    __IOM uint32_t I2SCTL;                      /*!< (@ 0x00000048) Specified polarity and clock configuration of
                                                                    the I2S IPB clocks and IO signals                          */

    struct {
      __IOM uint32_t TXEN       : 1;            /*!< [0..0] Transmit enable signal. 1 will enable the transmission
                                                     of serial audio. For Full duplex operation, RXEN and TXEN
                                                     MUST be set in a single register write access, or the Slave
                                                     FSM may ignore one of the bit-field read-modify-write accesses.
                                                     TXRST and RXRST must be cleared in advance.                               */
      __IOM uint32_t TXRST      : 1;            /*!< [1..1] Transmit reset signal. 1 will reset the TX side registers
                                                     and flush the TX FIFO.                                                    */
            uint32_t            : 2;
      __IOM uint32_t RXEN       : 1;            /*!< [4..4] Receive enable control. 1: Enables capture of serial
                                                     audio, starting with first channel. 0: No receive data
                                                     captured. For Full duplex operation, RXEN and TXEN MUST
                                                     be set in a single register write access, or the Slave
                                                     FSM may ignore one of the bit-field read-modify-write accesses.
                                                     TXRST and RXRST must be cleared in advance.                               */
      __IOM uint32_t RXRST      : 1;            /*!< [5..5] Active high receiver reset signal. 1: Flush the RX FIFO            */
            uint32_t            : 25;
      __IOM uint32_t I2SVAL     : 1;            /*!< [31..31] I2S validity bit mode. 1: RX data stored only when
                                                     validity mask condition is asserted. 0: No validity mask
                                                     conditions checking is done.                                              */
    } I2SCTL_b;
  } ;

  union {
    __IOM uint32_t IPBIRPT;                     /*!< (@ 0x0000004C) Additional mask and status registers for the
                                                                    IPB core.                                                  */

    struct {
      __IOM uint32_t RXFFM      : 1;            /*!< [0..0] Receive FIFO interrupt mask. Will assert interrupt when
                                                     = 1 and RXFFI is asserted                                                 */
      __IOM uint32_t TXFFM      : 1;            /*!< [1..1] Transmit FIFO interrupt mask. Will assert interrupt when
                                                     = 1 and TXFFI is asserted                                                 */
      __IOM uint32_t RXFM       : 1;            /*!< [2..2] Receive FIFO interrupt mask. Will assert interrupt when
                                                     = 1 and RXFI is asserted                                                  */
      __IOM uint32_t TXEM       : 1;            /*!< [3..3] Transmit FIFO interrupt mask. Will assert interrupt when
                                                     = 1 and TXEI is asserted                                                  */
      __IOM uint32_t RXDMAM     : 1;            /*!< [4..4] Receive FIFO interrupt mask. Will assert interrupt when
                                                     = 1 and cimdmareq_rx is asserted                                          */
      __IOM uint32_t TXDMAM     : 1;            /*!< [5..5] Transmit FIFO interrupt mask. Will assert interrupt when
                                                     = 1 and cimdmareq_tx is asserted                                          */
            uint32_t            : 10;
      __IOM uint32_t RXFFI      : 1;            /*!< [16..16] Receive fifo high limit interrupt                                */
      __IOM uint32_t TXFFI      : 1;            /*!< [17..17] Transmit fifo low limit interrupt                                */
      __IOM uint32_t RXFI       : 1;            /*!< [18..18] RX Full interrupt. RX unit attempted to write to a
                                                     full FIFO                                                                 */
      __IOM uint32_t TXEI       : 1;            /*!< [19..19] TX Empty interrupt. TX unit attempted to read an empty
                                                     FIFO                                                                      */
      __IOM uint32_t RXDMAI     : 1;            /*!< [20..20] RX dma interrupt                                                 */
      __IOM uint32_t TXDMAI     : 1;            /*!< [21..21] TX dma interrupt                                                 */
            uint32_t            : 10;
    } IPBIRPT_b;
  } ;

  union {
    __IOM uint32_t IPCOREID;                    /*!< (@ 0x00000050) Returns the core ID of the IPB core, and used
                                                                    to write the I2S validity mask.                            */

