ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
            uint32_t            : 6;
      __IOM uint32_t RXCLKACTTRIM : 5;          /*!< [10..6] This divides the 5 MHz refresh clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
            uint32_t            : 11;
      __IOM uint32_t TONCLKTRIM : 4;            /*!< [25..22] This divides the 100 MHz ton clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
            uint32_t            : 6;
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< (@ 0x00000344) SIMO Buck Muxed VDDC Active Sequence Trim Control          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t VDDCACTHIGHTONTRIM : 4;    /*!< [14..11] VDDC active high ton trim control for Buck sequence.             */
            uint32_t            : 9;
      __IOM uint32_t VDDCACTLOWTONTRIM : 5;     /*!< [28..24] VDDC active high ton trim control for Buck sequence.             */
            uint32_t            : 3;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< (@ 0x00000348) SIMO Buck Muxed VDDC low power Sequence Trim
                                                                    Control                                                    */

    struct {
            uint32_t            : 13;
      __IOM uint32_t VDDCLPHIGHTONTRIM : 4;     /*!< [16..13] VDDC LP high ton trim control for Buck sequence.                 */
            uint32_t            : 9;
      __IOM uint32_t VDDCLPLOWTONTRIM : 4;      /*!< [29..26] VDDC LP low ton trim control for Buck sequence.                  */
            uint32_t            : 2;
    } SIMOBUCK3_b;
  } ;
  __IM  uint32_t  RESERVED19[2];

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< (@ 0x00000354) SIMO Buck Muxed VDDF Active Sequence Trim Control          */

    struct {
            uint32_t            : 17;
      __IOM uint32_t VDDFACTHIGHTONTRIM : 4;    /*!< [20..17] VDDF active high ton trim control for Buck sequence.             */
            uint32_t            : 11;
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< (@ 0x00000358) SIMO Buck Muxed VDDF active Sequence Trim Control          */

    struct {
            uint32_t            : 8;
      __IOM uint32_t VDDFACTLOWTONTRIM : 5;     /*!< [12..8] VDDF active low ton trim control for Buck sequence.               */
            uint32_t            : 5;
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< [22..18] Zxcomp trim. Feedthrough to analog.                              */
            uint32_t            : 9;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< (@ 0x0000035C) SIMO Buck Muxed VDDF Low Power Sequence Trim
                                                                    Control                                                    */

    struct {
            uint32_t            : 9;
      __IOM uint32_t VDDFLPHIGHTONTRIM : 4;     /*!< [12..9] VDDF low power high ton trim control for Buck sequence.           */
            uint32_t            : 9;
      __IOM uint32_t VDDFLPLOWTONTRIM : 4;      /*!< [25..22] VDDF low power low ton trim control for Buck sequence.           */
            uint32_t            : 6;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< (@ 0x00000360) SIMO Buck Muxed VDDS Active Sequence Trim Control          */

    struct {
            uint32_t            : 17;
      __IOM uint32_t VDDSACTHIGHTONTRIM : 4;    /*!< [20..17] VDDS active high ton trim control for Buck sequence.             */
            uint32_t            : 1;
      __IOM uint32_t VDDSACTLOWTONTRIM : 5;     /*!< [26..22] VDDS active low ton trim control for Buck sequence.              */
            uint32_t            : 5;
    } SIMOBUCK9_b;
  } ;
  __IM  uint32_t  RESERVED20[2];

  union {
    __IOM uint32_t SIMOBUCK12;                  /*!< (@ 0x0000036C) SIMO Buck Compare, Brown out, Active, Low power
                                                                    Trim Control                                               */

    struct {
            uint32_t            : 20;
      __IOM uint32_t ACTTRIMVDDF : 6;           /*!< [25..20] Active VDDF trim.                                                */
      __IOM uint32_t LPTRIMVDDF : 6;            /*!< [31..26] Low power VDDF trim.                                             */
    } SIMOBUCK12_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK13;                  /*!< (@ 0x00000370) SIMO Buck Compare, Brown out, Active, Low power
                                                                    Trim Control                                               */

    struct {
            uint32_t            : 20;
      __IOM uint32_t ACTTRIMVDDS : 6;           /*!< [25..20] Active VDDS trim.                                                */
      __IOM uint32_t LPTRIMVDDS : 6;            /*!< [31..26] Low power VDDS trim.                                             */
    } SIMOBUCK13_b;
  } ;
  __IM  uint32_t  RESERVED21;

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< (@ 0x00000378) SIMO Buck Compare, Brown out, Active and Low
                                                                    power Trim Control                                         */

    struct {
            uint32_t            : 24;
      __IOM uint32_t ZXCOMPOFFSETTRIM : 5;      /*!< [28..24] Zxcomp offset trim. Feedthrough to analog.                       */
            uint32_t            : 2;
      __IOM uint32_t TRIMLATCHOVER : 1;         /*!< [31..31] Override / Bypass the simobuck trim latch to enable
                                                     on-the-fly trimming for VDDF and VDDS active and LP trims                 */
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< (@ 0x0000037C) PWRSW Control 0                                            */

