ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
    struct {
      __IOM uint32_t FR3BITS    : 32;           /*!< [31..0] Copy (read) protect flash 0x00180000 - 0x001FFFFF. Each
                                                     bit provides read protection for 16KB chunks of flash.
                                                     Bits are cleared by writing a 1 to the bit. When read,
                                                     0 indicates the region is protected. Bits are sticky (can
                                                     be set when PROTLOCK is 1, but only cleared by reset)                     */
    } FLASHRPROT3_b;
  } ;

  union {
    __IOM uint32_t DMASRAMWPROT0;               /*!< (@ 0x000003C8) These bits write-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMAWPROT0  : 32;           /*!< [31..0] Write protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA writes, when set
                                                     to 0, DMA may write the region.                                           */
    } DMASRAMWPROT0_b;
  } ;

  union {
    __IOM uint32_t DMASRAMWPROT1;               /*!< (@ 0x000003CC) These bits write-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMAWPROT1  : 16;           /*!< [15..0] Write protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA writes, when set
                                                     to 0, DMA may write the region.                                           */
            uint32_t            : 16;
    } DMASRAMWPROT1_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT0;               /*!< (@ 0x000003D0) These bits read-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMARPROT0  : 32;           /*!< [31..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
    } DMASRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t DMASRAMRPROT1;               /*!< (@ 0x000003D4) These bits read-protect system SRAM from DMA
                                                                    operations in 8KB chunks.                                  */

    struct {
      __IOM uint32_t DMARPROT1  : 16;           /*!< [15..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
            uint32_t            : 16;
    } DMASRAMRPROT1_b;
  } ;
  __IM  uint32_t  RESERVED24[16];

  union {
    __IOM uint32_t USBPHYRESET;                 /*!< (@ 0x00000418) DSP0 CACHE RAM TRIM                                        */

    struct {
      __IOM uint32_t USBPHYPORRSTDIS : 1;       /*!< [0..0] De-assert USB PHY POR reset override                               */
      __IOM uint32_t USBPHYUTMIRSTDIS : 1;      /*!< [1..1] De-assert USB PHY UTMI reset override                              */
      __IOM uint32_t RESERVED01 : 3;            /*!< [4..2] DSP0 ICACHE TAG EMA                                                */
      __IOM uint32_t RESERVED02 : 1;            /*!< [5..5] DSP0 ICACHE TAG EMAS                                               */
      __IOM uint32_t RESERVED03 : 2;            /*!< [7..6] DSP0 ICACHE TAG EMAW                                               */
      __IOM uint32_t RESERVED04 : 1;            /*!< [8..8] DSP0 ICACHE TAG RAWL                                               */
      __IOM uint32_t RESERVED05 : 2;            /*!< [10..9] DSP0 ICACHE TAG RAWLM                                             */
      __IOM uint32_t RESERVED06 : 1;            /*!< [11..11] DSP0 ICACHE TAG RAM WABL - Write Assist Enable (active
                                                     high)                                                                     */
      __IOM uint32_t RESERVED07 : 3;            /*!< [14..12] DSP0 ICACHE TAG WABLM - 00=No adjust 11=increased delay,
                                                     enabled by WABL                                                           */
            uint32_t            : 1;
      __IOM uint32_t RESERVED09 : 1;            /*!< [16..16] DSP0 ICACHE DATA RET1N value                                     */
      __IOM uint32_t RESERVED10 : 1;            /*!< [17..17] Override for DSP0 ICACHE DATA RET1N override enable              */
      __IOM uint32_t RESERVED11 : 3;            /*!< [20..18] DSP0 ICACHE DATA EMA                                             */
      __IOM uint32_t RESERVED12 : 1;            /*!< [21..21] DSP0 ICACHE DATA EMAS                                            */
      __IOM uint32_t RESERVED13 : 2;            /*!< [23..22] DSP0 ICACHE DATA EMAW                                            */
      __IOM uint32_t RESERVED14 : 1;            /*!< [24..24] DSP0 ICACHE DATA RAWL                                            */
      __IOM uint32_t RESERVED15 : 2;            /*!< [26..25] DSP0 ICACHE DATA RAWLM                                           */
      __IOM uint32_t RESERVED16 : 1;            /*!< [27..27] DSP0 ICACHE DATA RAM WABL - Write Assist Enable (active
                                                     high)                                                                     */
      __IOM uint32_t RESERVED17 : 3;            /*!< [30..28] DSP0 ICACHE DATA WABLM - 00=No adjust 11=increased
                                                     delay, enabled by WABL                                                    */
      __IOM uint32_t RESERVED18 : 1;            /*!< [31..31] Self-timed override (test mode only)                             */
    } USBPHYRESET_b;
  } ;
  __IM  uint32_t  RESERVED25[4];

  union {
    __IOM uint32_t AUDADCPWRCTRL;               /*!< (@ 0x0000042C) Audio ADC Power Control                                    */

