ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
/* ========================================================  PADKEY  ========================================================= */
/* ==============================================  GPIO PADKEY PADKEY [0..31]  =============================================== */
typedef enum {                                  /*!< GPIO_PADKEY_PADKEY                                                        */
  GPIO_PADKEY_PADKEY_Key               = 115,   /*!< Key : Key value to unlock the register.                                   */
} GPIO_PADKEY_PADKEY_Enum;

/* ==========================================================  RD0  ========================================================== */
/* ==========================================================  RD1  ========================================================== */
/* ==========================================================  RD2  ========================================================== */
/* ==========================================================  RD3  ========================================================== */
/* ==========================================================  WT0  ========================================================== */
/* ==========================================================  WT1  ========================================================== */
/* ==========================================================  WT2  ========================================================== */
/* ==========================================================  WT3  ========================================================== */
/* =========================================================  WTS0  ========================================================== */
/* =========================================================  WTS1  ========================================================== */
/* =========================================================  WTS2  ========================================================== */
/* =========================================================  WTS3  ========================================================== */
/* =========================================================  WTC0  ========================================================== */
/* =========================================================  WTC1  ========================================================== */
/* =========================================================  WTC2  ========================================================== */
/* =========================================================  WTC3  ========================================================== */
/* ==========================================================  EN0  ========================================================== */
/* ==========================================================  EN1  ========================================================== */
/* ==========================================================  EN2  ========================================================== */
/* ==========================================================  EN3  ========================================================== */
/* =========================================================  ENS0  ========================================================== */
/* =========================================================  ENS1  ========================================================== */
/* =========================================================  ENS2  ========================================================== */
/* =========================================================  ENS3  ========================================================== */
/* =========================================================  ENC0  ========================================================== */
/* =========================================================  ENC1  ========================================================== */
/* =========================================================  ENC2  ========================================================== */
/* =========================================================  ENC3  ========================================================== */
/* ========================================================  IOM0IRQ  ======================================================== */
/* ========================================================  IOM1IRQ  ======================================================== */
/* ========================================================  IOM2IRQ  ======================================================== */
/* ========================================================  IOM3IRQ  ======================================================== */
/* ========================================================  IOM4IRQ  ======================================================== */
/* ========================================================  IOM5IRQ  ======================================================== */
/* ========================================================  IOM6IRQ  ======================================================== */
/* ========================================================  IOM7IRQ  ======================================================== */
/* =======================================================  SDIFCDWP  ======================================================== */
/* ========================================================  OBSDATA  ======================================================== */
/* ========================================================  IEOBS0  ========================================================= */
/* ========================================================  IEOBS1  ========================================================= */
/* ========================================================  IEOBS2  ========================================================= */
/* ========================================================  IEOBS3  ========================================================= */
/* ========================================================  OEOBS0  ========================================================= */
/* ========================================================  OEOBS1  ========================================================= */
/* ========================================================  OEOBS2  ========================================================= */
/* ========================================================  OEOBS3  ========================================================= */
/* ======================================================  MCUN0INT0EN  ====================================================== */
/* =====================================================  MCUN0INT0STAT  ===================================================== */
/* =====================================================  MCUN0INT0CLR  ====================================================== */
/* =====================================================  MCUN0INT0SET  ====================================================== */
/* ======================================================  MCUN0INT1EN  ====================================================== */
/* =====================================================  MCUN0INT1STAT  ===================================================== */
/* =====================================================  MCUN0INT1CLR  ====================================================== */
/* =====================================================  MCUN0INT1SET  ====================================================== */
/* ======================================================  MCUN0INT2EN  ====================================================== */
/* =====================================================  MCUN0INT2STAT  ===================================================== */
/* =====================================================  MCUN0INT2CLR  ====================================================== */
/* =====================================================  MCUN0INT2SET  ====================================================== */
/* ======================================================  MCUN0INT3EN  ====================================================== */
/* =====================================================  MCUN0INT3STAT  ===================================================== */
/* =====================================================  MCUN0INT3CLR  ====================================================== */
/* =====================================================  MCUN0INT3SET  ====================================================== */
/* ======================================================  MCUN1INT0EN  ====================================================== */
/* =====================================================  MCUN1INT0STAT  ===================================================== */
/* =====================================================  MCUN1INT0CLR  ====================================================== */
/* =====================================================  MCUN1INT0SET  ====================================================== */
/* ======================================================  MCUN1INT1EN  ====================================================== */
/* =====================================================  MCUN1INT1STAT  ===================================================== */
/* =====================================================  MCUN1INT1CLR  ====================================================== */
/* =====================================================  MCUN1INT1SET  ====================================================== */
/* ======================================================  MCUN1INT2EN  ====================================================== */
/* =====================================================  MCUN1INT2STAT  ===================================================== */
/* =====================================================  MCUN1INT2CLR  ====================================================== */
/* =====================================================  MCUN1INT2SET  ====================================================== */
/* ======================================================  MCUN1INT3EN  ====================================================== */
/* =====================================================  MCUN1INT3STAT  ===================================================== */
/* =====================================================  MCUN1INT3CLR  ====================================================== */
/* =====================================================  MCUN1INT3SET  ====================================================== */
/* =====================================================  DSP0N0INT0EN  ====================================================== */
/* ====================================================  DSP0N0INT0STAT  ===================================================== */
/* =====================================================  DSP0N0INT0CLR  ===================================================== */
/* =====================================================  DSP0N0INT0SET  ===================================================== */
/* =====================================================  DSP0N0INT1EN  ====================================================== */
/* ====================================================  DSP0N0INT1STAT  ===================================================== */
/* =====================================================  DSP0N0INT1CLR  ===================================================== */
/* =====================================================  DSP0N0INT1SET  ===================================================== */
/* =====================================================  DSP0N0INT2EN  ====================================================== */
/* ====================================================  DSP0N0INT2STAT  ===================================================== */
/* =====================================================  DSP0N0INT2CLR  ===================================================== */
/* =====================================================  DSP0N0INT2SET  ===================================================== */
/* =====================================================  DSP0N0INT3EN  ====================================================== */
/* ====================================================  DSP0N0INT3STAT  ===================================================== */
/* =====================================================  DSP0N0INT3CLR  ===================================================== */
/* =====================================================  DSP0N0INT3SET  ===================================================== */
/* =====================================================  DSP0N1INT0EN  ====================================================== */
/* ====================================================  DSP0N1INT0STAT  ===================================================== */
/* =====================================================  DSP0N1INT0CLR  ===================================================== */
/* =====================================================  DSP0N1INT0SET  ===================================================== */
/* =====================================================  DSP0N1INT1EN  ====================================================== */
/* ====================================================  DSP0N1INT1STAT  ===================================================== */
/* =====================================================  DSP0N1INT1CLR  ===================================================== */
/* =====================================================  DSP0N1INT1SET  ===================================================== */
/* =====================================================  DSP0N1INT2EN  ====================================================== */
/* ====================================================  DSP0N1INT2STAT  ===================================================== */
/* =====================================================  DSP0N1INT2CLR  ===================================================== */
/* =====================================================  DSP0N1INT2SET  ===================================================== */
/* =====================================================  DSP0N1INT3EN  ====================================================== */
/* ====================================================  DSP0N1INT3STAT  ===================================================== */
/* =====================================================  DSP0N1INT3CLR  ===================================================== */
/* =====================================================  DSP0N1INT3SET  ===================================================== */
/* =====================================================  DSP1N0INT0EN  ====================================================== */
/* ====================================================  DSP1N0INT0STAT  ===================================================== */
/* =====================================================  DSP1N0INT0CLR  ===================================================== */
/* =====================================================  DSP1N0INT0SET  ===================================================== */
/* =====================================================  DSP1N0INT1EN  ====================================================== */
/* ====================================================  DSP1N0INT1STAT  ===================================================== */
/* =====================================================  DSP1N0INT1CLR  ===================================================== */
/* =====================================================  DSP1N0INT1SET  ===================================================== */
/* =====================================================  DSP1N0INT2EN  ====================================================== */
/* ====================================================  DSP1N0INT2STAT  ===================================================== */
/* =====================================================  DSP1N0INT2CLR  ===================================================== */
/* =====================================================  DSP1N0INT2SET  ===================================================== */
/* =====================================================  DSP1N0INT3EN  ====================================================== */
/* ====================================================  DSP1N0INT3STAT  ===================================================== */
/* =====================================================  DSP1N0INT3CLR  ===================================================== */
/* =====================================================  DSP1N0INT3SET  ===================================================== */
/* =====================================================  DSP1N1INT0EN  ====================================================== */
/* ====================================================  DSP1N1INT0STAT  ===================================================== */
/* =====================================================  DSP1N1INT0CLR  ===================================================== */
/* =====================================================  DSP1N1INT0SET  ===================================================== */
/* =====================================================  DSP1N1INT1EN  ====================================================== */
/* ====================================================  DSP1N1INT1STAT  ===================================================== */
/* =====================================================  DSP1N1INT1CLR  ===================================================== */
/* =====================================================  DSP1N1INT1SET  ===================================================== */
/* =====================================================  DSP1N1INT2EN  ====================================================== */
/* ====================================================  DSP1N1INT2STAT  ===================================================== */
/* =====================================================  DSP1N1INT2CLR  ===================================================== */
/* =====================================================  DSP1N1INT2SET  ===================================================== */
/* =====================================================  DSP1N1INT3EN  ====================================================== */
/* ====================================================  DSP1N1INT3STAT  ===================================================== */
/* =====================================================  DSP1N1INT3CLR  ===================================================== */
/* =====================================================  DSP1N1INT3SET  ===================================================== */


/* =========================================================================================================================== */
/* ================                                            GPU                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  TEX0BASE  ======================================================== */
/* ======================================================  TEX0STRIDE  ======================================================= */
/* ============================================  GPU TEX0STRIDE IMGFMT [24..31]  ============================================= */
typedef enum {                                  /*!< GPU_TEX0STRIDE_IMGFMT                                                     */
  GPU_TEX0STRIDE_IMGFMT_RGBX8888       = 0,     /*!< RGBX8888 : Color Space RGBX means, that the pixel format still
                                                     has an alpha channel, but it is ignored, and is always
                                                     set to 255. The RGBX 32 bit RGB format is stored in memory
                                                     as 8 red bits, 8 green bits, 8 blue bits, and 8 ignored
                                                     bits.                                                                     */
  GPU_TEX0STRIDE_IMGFMT_RGBA8888       = 1,     /*!< RGBA8888 : Color Space RED GREEN BLUE ALPHA (internal format
                                                     is always on: 32-bit)                                                     */
  GPU_TEX0STRIDE_IMGFMT_XRGB8888       = 2,     /*!< XRGB8888 : Color Space                                                    */
  GPU_TEX0STRIDE_IMGFMT_ARGB8888       = 3,     /*!< ARGB8888 : Color Space In the ARGB (word-order) encoding the
                                                     intensity of each channel sample is defined by 8 bits,
                                                     and are arranged in memory in such manner that a single
                                                     32-bit unsigned integer has the alpha sample in the highest
                                                     8 bits, followed by the red sample, green sample and finally
                                                     the blue sample in the lowest 8 bits                                      */
  GPU_TEX0STRIDE_IMGFMT_RGBA565        = 4,     /*!< RGBA565 : Color Space RED(5-bits) GREEN(6-bits) BLUE (5-bits)             */
  GPU_TEX0STRIDE_IMGFMT_RGBA5551       = 5,     /*!< RGBA5551 : Color Space Red,green,blue,alpha (transparency).               */
  GPU_TEX0STRIDE_IMGFMT_L8             = 9,     /*!< L8 : Color Space Lum8 grayscale                                           */
  GPU_TEX0STRIDE_IMGFMT_TSC4           = 18,    /*!< TSC4 : Color Space Proprietary texture compression                        */
  GPU_TEX0STRIDE_IMGFMT_TSC6           = 22,    /*!< TSC6 : Color Space Optional proprietary texture compression               */
  GPU_TEX0STRIDE_IMGFMT_TSC6A          = 23,    /*!< TSC6A : Color Space Optional proprietary texture compression              */
} GPU_TEX0STRIDE_IMGFMT_Enum;

/* ============================================  GPU TEX0STRIDE IMGMODE [16..23]  ============================================ */
typedef enum {                                  /*!< GPU_TEX0STRIDE_IMGMODE                                                    */
  GPU_TEX0STRIDE_IMGMODE_POINTSAMPLE   = 0,     /*!< POINTSAMPLE : Texture mapping: rotate, resize and distort a
                                                     bitmap image. Nearest neighbor sampling.                                  */
  GPU_TEX0STRIDE_IMGMODE_BILINEARFILTERING = 1, /*!< BILINEARFILTERING : Texture mapping: rotate, resize and distort
                                                     a bitmap image. A method used to smooth textures when displayed
                                                     larger or smaller than they actually are.                                 */
} GPU_TEX0STRIDE_IMGMODE_Enum;

