ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
/* ===========================================  SDIO INTSTAT BLOCKGAPEVENT [2..2]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_BLOCKGAPEVENT                                                */
  SDIO_INTSTAT_BLOCKGAPEVENT_NOEVENT   = 0,     /*!< NOEVENT : No Block Gap Event                                              */
  SDIO_INTSTAT_BLOCKGAPEVENT_STOPPED   = 1,     /*!< STOPPED : Transaction stopped at Block Gap                                */
} SDIO_INTSTAT_BLOCKGAPEVENT_Enum;

/* =========================================  SDIO INTSTAT TRANSFERCOMPLETE [1..1]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_TRANSFERCOMPLETE                                             */
  SDIO_INTSTAT_TRANSFERCOMPLETE_NODATA = 0,     /*!< NODATA : No Data Transfer Complete                                        */
  SDIO_INTSTAT_TRANSFERCOMPLETE_COMPLETE = 1,   /*!< COMPLETE : Data Transfer Complete                                         */
} SDIO_INTSTAT_TRANSFERCOMPLETE_Enum;

/* ==========================================  SDIO INTSTAT COMMANDCOMPLETE [0..0]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSTAT_COMMANDCOMPLETE                                              */
  SDIO_INTSTAT_COMMANDCOMPLETE_NOCMP   = 0,     /*!< NOCMP : No Command Complete                                               */
  SDIO_INTSTAT_COMMANDCOMPLETE_CMDCMP  = 1,     /*!< CMDCMP : Command Complete                                                 */
} SDIO_INTSTAT_COMMANDCOMPLETE_Enum;

/* =======================================================  INTENABLE  ======================================================= */
/* ========================================================  INTSIG  ========================================================= */
/* ============================================  SDIO INTSIG TGTRESPEN [28..28]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_TGTRESPEN                                                     */
  SDIO_INTSIG_TGTRESPEN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_TGTRESPEN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_TGTRESPEN_Enum;

/* ===========================================  SDIO INTSIG TUNINGERREN [26..26]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSIG_TUNINGERREN                                                   */
  SDIO_INTSIG_TUNINGERREN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_TUNINGERREN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_TUNINGERREN_Enum;

/* ============================================  SDIO INTSIG ADMAERREN [25..25]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_ADMAERREN                                                     */
  SDIO_INTSIG_ADMAERREN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_ADMAERREN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_ADMAERREN_Enum;

/* ==========================================  SDIO INTSIG AUTOCMD12ERREN [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_AUTOCMD12ERREN                                                */
  SDIO_INTSIG_AUTOCMD12ERREN_MASKED    = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_AUTOCMD12ERREN_ENABLED   = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_AUTOCMD12ERREN_Enum;

/* ===========================================  SDIO INTSIG CURRLMTERREN [23..23]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_CURRLMTERREN                                                  */
  SDIO_INTSIG_CURRLMTERREN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CURRLMTERREN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CURRLMTERREN_Enum;

/* ===========================================  SDIO INTSIG DATAENDERREN [22..22]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_DATAENDERREN                                                  */
  SDIO_INTSIG_DATAENDERREN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_DATAENDERREN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_DATAENDERREN_Enum;

/* ===========================================  SDIO INTSIG DATACRCERREN [21..21]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_DATACRCERREN                                                  */
  SDIO_INTSIG_DATACRCERREN_MASKED      = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_DATACRCERREN_ENABLED     = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_DATACRCERREN_Enum;

/* ==========================================  SDIO INTSIG DATATOERROREN [20..20]  =========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_DATATOERROREN                                                 */
  SDIO_INTSIG_DATATOERROREN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_DATATOERROREN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_DATATOERROREN_Enum;

/* ===========================================  SDIO INTSIG CMDIDXERREN [19..19]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSIG_CMDIDXERREN                                                   */
  SDIO_INTSIG_CMDIDXERREN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CMDIDXERREN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CMDIDXERREN_Enum;

/* ==========================================  SDIO INTSIG CMDENDBITERREN [18..18]  ========================================== */
typedef enum {                                  /*!< SDIO_INTSIG_CMDENDBITERREN                                                */
  SDIO_INTSIG_CMDENDBITERREN_MASKED    = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CMDENDBITERREN_ENABLED   = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CMDENDBITERREN_Enum;

/* ===========================================  SDIO INTSIG CMDCRCERREN [17..17]  ============================================ */
typedef enum {                                  /*!< SDIO_INTSIG_CMDCRCERREN                                                   */
  SDIO_INTSIG_CMDCRCERREN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CMDCRCERREN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CMDCRCERREN_Enum;

