ka-cyber/tikuos-information-aware/upstream/tikuOS/arch/ambiq/cmsis/apollo4l.h
/* =============================================  SDIO INTSIG BUFFERRDEN [5..5]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_BUFFERRDEN                                                    */
  SDIO_INTSIG_BUFFERRDEN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_BUFFERRDEN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_BUFFERRDEN_Enum;

/* =============================================  SDIO INTSIG BUFFERWREN [4..4]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_BUFFERWREN                                                    */
  SDIO_INTSIG_BUFFERWREN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_BUFFERWREN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_BUFFERWREN_Enum;

/* ==============================================  SDIO INTSIG DMAINTEN [3..3]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_DMAINTEN                                                      */
  SDIO_INTSIG_DMAINTEN_MASKED          = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_DMAINTEN_ENABLED         = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_DMAINTEN_Enum;

/* =============================================  SDIO INTSIG BLOCKGAPEN [2..2]  ============================================= */
typedef enum {                                  /*!< SDIO_INTSIG_BLOCKGAPEN                                                    */
  SDIO_INTSIG_BLOCKGAPEN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_BLOCKGAPEN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_BLOCKGAPEN_Enum;

/* =============================================  SDIO INTSIG XFERCMPEN [1..1]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_XFERCMPEN                                                     */
  SDIO_INTSIG_XFERCMPEN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_XFERCMPEN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_XFERCMPEN_Enum;

/* ==============================================  SDIO INTSIG CMDCMPEN [0..0]  ============================================== */
typedef enum {                                  /*!< SDIO_INTSIG_CMDCMPEN                                                      */
  SDIO_INTSIG_CMDCMPEN_MASKED          = 0,     /*!< MASKED : Masked                                                           */
  SDIO_INTSIG_CMDCMPEN_ENABLED         = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO_INTSIG_CMDCMPEN_Enum;

/* =========================================================  AUTO  ========================================================== */
/* ==============================================  SDIO AUTO PRESETEN [31..31]  ============================================== */
typedef enum {                                  /*!< SDIO_AUTO_PRESETEN                                                        */
  SDIO_AUTO_PRESETEN_AUTOEN            = 1,     /*!< AUTOEN : Automatic Selection by Preset Value are Enabled                  */
  SDIO_AUTO_PRESETEN_HOSTCTRL          = 0,     /*!< HOSTCTRL : SDCLK and Driver Strength are controlled by Host
                                                     Driver                                                                    */
} SDIO_AUTO_PRESETEN_Enum;

/* =============================================  SDIO AUTO ASYNCINTEN [30..30]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_ASYNCINTEN                                                      */
  SDIO_AUTO_ASYNCINTEN_ENABLED         = 1,     /*!< ENABLED : Enabled,                                                        */
  SDIO_AUTO_ASYNCINTEN_DISABLED        = 0,     /*!< DISABLED : Disabled                                                       */
} SDIO_AUTO_ASYNCINTEN_Enum;

/* ============================================  SDIO AUTO SAMPLCLKSEL [23..23]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_SAMPLCLKSEL                                                     */
  SDIO_AUTO_SAMPLCLKSEL_TUNEDCLK       = 1,     /*!< TUNEDCLK : Tuned clock is used to sample data                             */
  SDIO_AUTO_SAMPLCLKSEL_FIXEDCLK       = 0,     /*!< FIXEDCLK : Fixed clock is used to sample data                             */
} SDIO_AUTO_SAMPLCLKSEL_Enum;

/* ============================================  SDIO AUTO STARTTUNING [22..22]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_STARTTUNING                                                     */
  SDIO_AUTO_STARTTUNING_TUNESTART      = 1,     /*!< TUNESTART : Execute Tuning,                                               */
  SDIO_AUTO_STARTTUNING_TUNECMP        = 0,     /*!< TUNECMP : Not Tuned or Tuning Completed                                   */
} SDIO_AUTO_STARTTUNING_Enum;

/* =============================================  SDIO AUTO DRVRSTRSEL [20..21]  ============================================= */
typedef enum {                                  /*!< SDIO_AUTO_DRVRSTRSEL                                                      */
  SDIO_AUTO_DRVRSTRSEL_DRVRB           = 0,     /*!< DRVRB : Driver Type B is Selected (Default)                               */
  SDIO_AUTO_DRVRSTRSEL_DRVRA           = 1,     /*!< DRVRA : Driver Type A is Selected                                         */
  SDIO_AUTO_DRVRSTRSEL_DRVRC           = 2,     /*!< DRVRC : Driver Type C is Selected                                         */
  SDIO_AUTO_DRVRSTRSEL_DRVRD           = 3,     /*!< DRVRD : Driver Type D is Selected                                         */
} SDIO_AUTO_DRVRSTRSEL_Enum;

